## Terraform Plan Result


### environments/stg/db
```
  + create
  + resource "aws_db_subnet_group" "this" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = "stg-mysql-subnet-group"
      + name_prefix             = (known after apply)
      + region                  = "ap-southeast-2"
      + subnet_ids              = [
          + "subnet-03be5488529f20f8a",
          + "subnet-0cb10c4cd93eaaa99",
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Created_by"  = "Tong Viet Hoang"
          + "Environment" = "Staging"
          + "Project"     = "STP-2025"
      + tags_all                = {
          + "Created_by"  = "Tong Viet Hoang"
          + "Environment" = "Staging"
          + "Project"     = "STP-2025"
      + vpc_id                  = (known after apply)
Plan: 1 to add, 0 to change, 0 to destroy.
Changes to Outputs:
  + db_subnet_group_name = "stg-mysql-subnet-group"
```
<!-- Sticky Pull Request Commentterraform-plan -->